Revit 2027 API
EnergyAnalysisDetailModel.TransformModel Method
 Transforms all surfaces in the model according to the document's active ground plane, shared coordinates and true north.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void TransformModel()
Public Sub TransformModel
public:
void TransformModel()
member TransformModel : unit -> unit
Exceptions
Exception | Condition
InvalidOperationException |  This operation failed.
See Also
Reference
EnergyAnalysisDetailModel Class
Autodesk.Revit.DB.Analysis Namespace